[
    {
        "pro": "\nDatameer is the industry leader in big data and our leadership, operational, HR, sales, marketing, engineering, communications, finance, and administrative teams are upper echelon. It's a vibrant company with a lot of exciting milestones to come and it gives our employees the chance to work with the biggest companies in the world.\n", 
        "con": "\nIt's a growing company with growing pains, but that's why we are hiring smart and talented people to help solve these problems as we grow.\n"
    }, 
    {
        "pro": "\nGreat employees & good product\n", 
        "con": "\nI've never worked for a company with such high churn/turnover. People are leaving every month, including management/VP level. In order to offset this, HR is trying to hire left & right by not thoroughly interviewing and just picking the next person that applies. It's so ridiculous who they are hiring these days. HR is not thinking this through.\nAdvice to Management\nFix the churn/turnover!! Please sympathize with the employees. My experience with upper management (including CEO) is a very demotivating & rude one. Respect your employees & listen to them. Don't just beat them down and tell them \"this is wrong\"\n"
    }, 
    {
        "pro": "\nThe smartest, funniest, best at their jobs people work in the Datameer NYC office. It is a privilege to come to work every day with these thought leaders in the software industry. The East coast vibe in the Datameer office is second to none and many overlapping cultures leads to a warm welcoming environment which is also one of the most productive in the industry!\n", 
        "con": "\nOffice is starting to get a bit cramped, may need a bigger space soon. Distance from the mothership means NYC sometimes is last to know\nAdvice to Management\nBottle the NYC lightning, or just move the HQ there!\n"
    }, 
    {
        "pro": "\n- Good technology - Smart dev team\n", 
        "con": "\n- Hiring Kenneth (Ken) Jakobsen as the Chief Revenue Officer was the biggest mistake. The guy is clueless when it comes to being a C-Level executive, let alone being responsibility for the companies revenue. He often times will just go on tangents based on some LinkedIn article he read that day. The only thing that he is good at playing his cards right and building rapport with fellow management. - He's made a few co… \nShow More\nAdvice to Management\nGet the right leadership in place. We really can't afford as a company to continue to make mistakes with mis-hires.\n"
    }, 
    {
        "pro": "\n- Cutting edge technology that's unparalleled in the Big Data space. - On the higher spectrum of the pay scale comparatively. - Great benefits (minus the laughable amount of equity). - Fairly transparent in regards to sensitive company information. - CEO is genuinely a good person. - Most employees are intelligent, sociable individuals who are a joy to be around. - Company has made strides to become more diverse whic… \nShow More\n", 
        "con": "\n- Turnover in the San Francisco office is simply out of control, yet management absolves itself of all culpability. - Certain departments have a \"locker room\" vibe; there is downright sophomoric, unprofessional behavior which is condoned and perpetuated by certain people in management. - Product vision has shifted drastically and is now murky and ill-defined. - One-upmanship, brown nosing, and back stabbing are encou… \nShow More\nAdvice to Management\nHone in, from a technology standpoint, on what Datameer does best. The deteriorating culture is top down, keep your eyes and minds open to change--you'll need to do this to survive.\n"
    }, 
    {
        "pro": "\nGood group of people to work with, very little in the way of politics. Anyone who slacks off or is just incompetent gets let go, so everyone is expected to pull their weight. Food and drinks provided. Good product in a hot space, stands up well against new competitors and established companies.\n", 
        "con": "\nNot much to say other than what many other reviews on the company have already stated. CEO needs to allow more freedom & flexibility to employees so they can be happy and successful. Equity stake is not enough to motivate people and deal with the working conditions and lack of freedom at the company, so turnover is quite high. Company divided between US and Germany, not the ideal situation for any company much le… \nShow More\n"
    }, 
    {
        "pro": "\nGreat personal career growth opportunities Product is very put together and mature in an immature market You will carry real responsibility and make an impact to the overall company Fast paced\n", 
        "con": "\nGoing above and beyond in every way is expected Fairly high employee attrition Engineering driven culture - if you work in sales or marketing you are viewed as an interchangeable resource\nAdvice to Management\nKeep innovating the product at the high pace\n"
    }, 
    {
        "pro": "\n-Leader in the Big Data space and peripheral technologies -Brand recognition is very healthy -Strategies for sales/retention are growing stronger each day -Hiring practices are strategic to address most prominent business and people needs -Runs lean to provide everyone with competitive salaries -Building a culture of feedback and transparency for the leadership team -Accelerated career paths and opportunities are wid… \nShow More\n", 
        "con": "\n-Growing pains associated with change have a negative impact on certain individuals -The career path presents a number of 'first time managers' and that's positive, but has its challenges associated with it. The management/leadership culture has room to grow but is not likely to affect the company outlook. -The executive team is evolving, in a good way, but that changes the landscape in a way that affects many -The e… \nShow More\nAdvice to Management\nKeep working on transparency, openness, being 'good getters' of feedback, and sharing what actions you're taking to correct concerns with the team. The perceptions require action because it's how people feel, and we have to be open as leaders to take feedback and make a change.\n"
    }, 
    {
        "pro": "\nI've been working at Datameer for almost 4 years now. From my experience as an engineer this is a great environment, working with smart people in an agile process with cutting-edge technology. The company has offices in Germany, New York and San Francisco and welcomes employees to work and visit the other locations for extended periods.\n", 
        "con": "\nThe challenges ahead for the company are to find a way to continue to grow while maintaining culture and agility - issues I believe we're on a good track to overcome.\n"
    }, 
    {
        "pro": "\nI have been a regional Sales Executive at Datameer for about six months. Prior to this I had similar sales roles at SAP and IBM, and several years running a boutique systems integrator. Datameer's product depth, customer loyalty, and positioning in the market place are superb. The quality of human talent here - both in skills and in attitude - is better than I have seen anywhere. After less than two quarters, I am li… \nShow More\n", 
        "con": "\nDatameer's solution is unusually complete for its market (end-to-end analytics for Hadoop). Some prospects need to be walked through the current state of the market, and where Datameer fits. Nothing an experienced sales executive can't handle. Datameer is not yet a household name, although we are getting there.\nAdvice to Management\nBe more aggressive with pushing the Datameer brand, and it's loyal customer base. Over 150 enterprise customers; in the Hadoop space? That's unheard of. Datameer is the one of the first, and the most successful, solution in the Hadoop space. Let the world know. Be proud, be loud\n"
    }, 
    {
        "pro": "\nFree bi-weekly lunch Fully stocked snacks Health, dental, and vision Weekly happy hours Dog friendly environment\n", 
        "con": "\n-Everything must be approved by the CEO, even if it is something small. He wants thing done in a very specific way, but his way does not always make sense, and his way isn't the best/efficient route to take. -Company is very frugal. Expectations are high but spending budget are low. -There is a lack of trust from the CEO to the employees and from employees to employees. Employees are allowed the opportunity to work f… \nShow More\n"
    }, 
    {
        "pro": "\nThe company is a startup, so there are tons of opportunities to help mold the company and truly make a huge impact at any level. Compensation is great, and all of the senior management team is considered one of the best in their fields. The product is also considered the best in the business and is way ahead of the competition. The company goes out of its way to seek the very best people in terms of accomplishment an… \nShow More\n", 
        "con": "\nI'm not going to sugar coat it, I've worked in Fortune 100 companies, and there is no doubt the benefits here are much less than those of a Fortune 100 company. You will be working hard every day, people will expect results consistently, and you will without a doubt be going over 40 hours every week. That being said, you also will have many many opportunities to make a huge impact on the company. So that's why I say … \nShow More\nAdvice to Management\nFocus more on positive reinforcement for even the little things.\n"
    }, 
    {
        "pro": "\nRelevant superior technology, great people to work with, transparent approachable leadership, solving analytic challenges to complex problems in Big Data is an addictive experience with Datameer. Open and collaborative environment, great location in SF for HQ, work hard play hard mentality.\n", 
        "con": "\nSome start-up growing pains with support systems, hard to find people with the Big Data skill sets needed for open positions, and can be hard to keep those people once they get the experience, the Big Data space seems to be above average for employee churn as the space continues to explode.\nAdvice to Management\nWhen possible, hire experienced folks who are less app to churn once their Big Data skill set is primed.\n"
    }, 
    {
        "pro": "\nThe most obvious one is that we are at the right place at the right time. We have first-mover advantage in one of the hottest markets there is, and we are only now finally starting to see some ankle-biters of competition. But with 4+ years of development ahead, a visionary and very involved *product* CEO at the helm, and just huge market opportunity, this is an amazing place to work if you are just as hungry to win. … \nShow More\n", 
        "con": "\nWith any high-growth startup there is going to be growing pains. There is no rest for the weary. You have to want this. There were a few negative people within the organization who have mostly weeded themselves out now but there are a couple left.\nAdvice to Management\nContinue to push for the best of the best and invest in the product and the team. Allow for a little more traditional organizational hierarchy as we continue to grow rapidly, so as not to impede our own progress.\n"
    }, 
    {
        "pro": "\nPeople are smart and easy to get along with. The office is small enough so that it feels warm and inviting People are engaged and invite you to join in with various activities If you don't know something, you feel comfortable asking; it's an open learning environment The leadership team is open to new ideas and is very involved Pet friendly office Easy to get to (good location) I feel that there is room to grow and b… \nShow More\n", 
        "con": "\nBenefits and perks are nice, but nothing spectacular Work life balance seems possible but being on-site is very important to the CEO, so WFH option isn't a given. Start-up companies often require their employees to adapt and be nimble, which isn't for everyone. Parking can be a little tedious at times\n"
    }, 
    {
        "pro": "\nIf you like the fast paced environment of a startup and being challenged by really smart people who are paving the way, then Datameer is for you. As with most (if not all) startups, the great thing is you get to try your hand at different parts of the business that you might not have access to at a larger company. The executive team is mostly approachable which is a far cry from a lot of other companies.\n", 
        "con": "\nIt is a startup so the company is getting built now, which is cool because you can have a hand in its development but that also means there are a lot of kinks (for example, no VP of HR). That being said, I'd rather the executive team take their time and hire really good people rather than run out and hire the next person that applies just because we need the position filled. Also, I do feel that other startups have m… \nShow More\nAdvice to Management\nIt is really important that you maintain your transparency and approachability (in fact, increase it). Better communication across the board.\n"
    }, 
    {
        "pro": "\nGreat product! The technology is simply the best out there. The engineering team in Germany is fantastic. Most of the people working here are top tier talent and really fun to learn from. Also, great compensation. Datameer pays better than most. Amazing list of customers too!\n", 
        "con": "\nWorst leadership in the valley. The CEO is arrogant, controlling, unapproachable, and unpolished. He micromanages every aspect of the business. The rate of employee churn is very high in the San Francisco office. The happy employees are in the Germany and New York offices where leadership isn't. The executive staff's poor leadership really holds the company back. There is a huge employee morale/culture problem in the… \nShow More\nAdvice to Management\nThis Company needs a new CEO. Move the current one to focus on the product where he's a modern day genius and will be good at his job. Let someone with better leadership skills drive the company forward. You hire awesome people and don't give them the freedom to do their jobs. Trust in the people you hire and don't assume they are lazy. Your employees are your greatest asset. Treat them better and you will be rewarde… \nShow More\n"
    }, 
    {
        "pro": "\nGreat Business Model. Datameer enables people with less technical knowledge to use the power of Big Data and the solution is probably one of the best in its kind\n", 
        "con": "\nThe executive team (Mostly CEO and CMO) have big egos. Here is my feeling of their behavioral preferences: not listening to people & behaving on border line of being rude and stubborn. I think probably most of the team members stay because of the good pay and if they find better opportunities, they are out. Problem is, the company from outside doesn't look like this. The CEO specifically has good presentation and… \nShow More\nAdvice to Management\nListen to people and trust them. Don't think you know everything and you should micro manage everyone. Look at results!\n"
    }, 
    {
        "pro": "\nThe office is in San Francisco. There are good people who work there.\n", 
        "con": "\nWhen the office looks a bit empty, he has his spies walk around to do attendance to see who is not in the office that day and yells at those people the next day. If you want to be watched over like children and not trusted, then this would be a good place for you, if not, do yourself a favor and don't waste your time even interviewing.\nAdvice to Management\nGet rid of the main reason the culture is so terrible there. The CEO. He is the reason that the turn over is so high. Advice to board: ask what the employee turnover rate is.\n"
    }, 
    {
        "pro": "\nGreat people, innovative product, charismatic leadership. Management pushes employees hard to build character & skill.\n", 
        "con": "\nTurn over takes toll on culture.\nAdvice to Management\nEncourage work/life balance.\n"
    }, 
    {
        "pro": "\nDatameer is such an innovative company, I work with a lot of smart, talented and passionate people. Datameer has an amazing product that is very unique to the big data space. It has received a lot of traction in the news recently. We just moved offices and the location in San Francisco is close to BART and being on the 4th floor we have an amazing view of the city! Light, bright and airy! This is also an organization… \nShow More\n", 
        "con": "\nBeing a startup, sometimes certain projects take more time with work/life balance, but it is not all the time and what you do here, you can really see a difference and how it impacts business!\nAdvice to Management\nKeep up with the innovation of the product. Recognize hard workers and be willing to be flexible with employees.\n"
    }, 
    {
        "pro": "\n- Lots of opportunity to make a difference - Lean product with lots of potential - Great, smart, hard working people willing to help each other succeed - Lots of visibility on where company is heading - Generous benefits - Numerous career opportunities.\n", 
        "con": "\n- Not an environment to warm up a seat every day. - As a fast growing company, lots of challenges keeping internal systems organized (Growing pains). - Need to trim some fat from product and focus on things Datameer is good at.\nAdvice to Management\nFast growing companies need great people to take things to next level. Need to invest more resources to attract and maintain great people. Also, as a growing global company, communication challenges need to be addressed by adopting better collaboration tools.\n"
    }, 
    {
        "pro": "\n- Exploding market space - Intelligent and hard working team - Great product that has backing by an impressive list of Fortune companies (including a few that have also decided to invest in the company)\n", 
        "con": "\n- Lacking the publicity of some of the bigger players\n"
    }, 
    {
        "pro": "\nChallenging work and learning environment for the Hadoop Ecosystem\n", 
        "con": "\nDatameer \"the app\" is a jack of all BI trades master of none. Sales strategy is nonexistence to inconsistent at best.\n"
    }, 
    {
        "pro": "\nSolving an interesting problem with exciting technology, big data is a huge area of upside and some of the tier one venture capitalists have taken notice. Datameer is in a space that is growing rapidly.\n", 
        "con": "\nNothing gets done without the CEO approval. Lot's of bullying and talking down to people. Isolated office space, no one communicates with each other. Lack of interesting perspectives or ideas, unless of course it comes from the CEO. Several people have left due to the brutal and unforgiving culture.\nAdvice to Management\ndelegate decisions, trust your people, and hire nicer people.\n"
    }, 
    {
        "pro": "\nBig Data is a high growth technology area and you could use your experience at Datameer as a stepping stone into a better company.\n", 
        "con": "\nCEO disrespects employees and is a control freak on steroids. He has no previous experience and lacks the leadership and vision to make a company successful. Mediocre product that has gotten more attention than it deserves due to the hot Big Data sector Lack of teamwork and distrust among coworkers which is in large part fostered by the CEO Long hours and below-market compensation\n"
    }, 
    {
        "pro": "\nThe product is extremely effective in small to large organizations. And the most successful companies continue to use the product year after year. People are smart, hard-working, creative and fun to work with.\n", 
        "con": "\nUnlike at some companies, you need to focus and get things done. If you prefer to come up with ideas and not follow through, this is not the place for you.\nAdvice to Management\nContinue to grow and empower your employees as you grow the company.\n"
    }, 
    {
        "pro": "\nThe product is extremely effective, and the biggest, most successful companies continue to use the product year after year. Dynamic, hard-working, create and smart people that are fun to work with.\n", 
        "con": "\nUnlike some companies, this is a place you need to execute. So you need to enjoy what you're doing and stay focused on results. If you like to pontificate and not do the work, this is not the place for you.\nAdvice to Management\nHire good people and continue to grow existing employees\n"
    }, 
    {
        "pro": "\nThe product in development has a great opportunity to solve large and small data integration and visualization needs for all company sizes. Some incredible engineers and people working at the company that made coming to work enjoyable. A very big market opportunity and a good place to work.\n", 
        "con": "\nThe CEO was difficult to work with. While very talented in many aspects like engineering, product management and design, his leadership style is inconsistent and immature. The board members and other management are solid which helps.\nAdvice to Management\nContinue to build a great product and work to keep the great people there.\n"
    }, 
    {
        "pro": "\nFree lunch? A few very nice hard working folks.\n", 
        "con": "\nRemote, lack of culture, lack of content employees, lack of respect for fellow employees. CEO apprarently drinks a lot but doesn't allow employees to. General lack of energy, excitement and inspiration from staff. Internal systems are very disorganized and everyone seems to be on the wrong page more times than not.\nAdvice to Management\nHire leaders who care and employees that desire to create an amazing work environment.\n"
    }, 
    {
        "pro": "\nGreat product and great team in Halle, Germany. Its a shame the best people are so far away.\n", 
        "con": "\nMost of the management team is never in the office. No company strategy, no benefits for employees, controlling CEO, and a dishonest work environment. Company culture starts from the top. In Datameer's case, the CEO creates a culture of distrust, fear, disorganization, disrespectful attitude towards women, casual drinking and one up man ship that has led to some of their best folks running for the exits.\nAdvice to Management\nBring in some new leadership before its too late. The window on Big Data is closing fast and you can't afford to waste any more time with failed projects and child like behavior.\n"
    }, 
    {
        "pro": "\nMarket leading company that is continually pushing innovation in analytics. Very unique technology approach gives a competitive advantage against all of the wannabes coming to the space. Datameer is moving fast but with a vision to leverage Hadoop and make analytics available to lost more business people. Great place to work, great team attitude and its fun working with the extended team around the world and with cus… \nShow More\n", 
        "con": "\nNone really, the market is moving fast so its challenging but that is what a leading startup is all about.\nAdvice to Management\nKeep focused on the vision and keep pushing to make customers successful and the rest will take care of itself.\n"
    }, 
    {
        "pro": "\n- good working environment, familiar atmosphere, helpful colleagues - encouraging and helpful colleagues - good team spirit - free fruit and coffee - flexibility with home office - mulit-cultural!\n", 
        "con": "\n- some communication problems which is based on the fact that the teams are distributed all over Germany and the US + english/german - responsibilities are not always clear - sometimes very late/early working times because of the time shift\n"
    }, 
    {
        "pro": "\nThey have an extremely promising product and are dead center in a high-growth and very interesting technology space. The leadership is open, approachable and communicative. The package/benefits/time-off are good-to-excellent. Datameer is a 5 year old startup, is well-funded and tightly managed so the VC money is not frittered away. There is potential to move-up the ranks and get promoted, or switch your role.\n", 
        "con": "\nNo cons other than the usual start-up symptoms: Very careful in terms of expenditure which sometimes restricts or slows-down marketing, company growth and hiring activity for example. Slightly higher than average employee turnover (probably due to the red-hot tech sector Datameer occupies, and a recent office move in the bay area).\n"
    }, 
    {
        "pro": "\nA good work culture and encouraging work environment. Experienced and Passionate Team who shares the same vision. The product is amazing and is one step solution for multiple Big Data challenges.\n", 
        "con": "\nAs a fast growing startup, surely there are challenges(pains) which needs to be addressed.\nAdvice to Management\nWork more closely with existing Human Resource and invest more on it.\n"
    }, 
    {
        "pro": "\nGreat, talented and focused people. Everyone is really supportive. Great company vision with a clear plan. Amazing product - first of it's class in the Big Data market.\n", 
        "con": "\nNon reall - I do not understand the negative reviews on Glassdoor...\nAdvice to Management\nKeep focused and invest in social activities like regular meetups to strenghten disconnected team.\n"
    }, 
    {
        "pro": "\nFriendly atmosphere, non-political. Catered lunches.\n", 
        "con": "\nin short: the CEO - Over-inflated ego, thinks he is steve Jobs, has a very dictatorial attitude; an example among many: he ordered employees to write positive reviews on glassdoor .. also employees have to use their own twitter account to tweet positively about the company .. No personal life, must be dedicated to the company. Dont apply if you are married/children and want to spend time with them.\nAdvice to Management\nadvice to the board; change the CEO before it's too late..\n"
    }, 
    {
        "pro": "\n- Unser deutsches (Ur-) Büro ist inzwischen der Haupt Entwicklungsstandort für Datameer, und immer noch im schönen, kleinen Halle - Dadurch, dass es nur R&D ist, ist man ungestört und es lässt sich super konzentriert (und Agile - Scrum) arbeiten - Die internationale Zugehörigkeit ist toll und wir können zum 'GeekInn' entweder nach NYC oder SF - Flexible Arbeitszeiten mit Homeoffice Möglichkeit von Zeit zu Zeit - … \nShow More\n", 
        "con": "\n- Agiles Arbeiten in Scrum durch 2 Zeitzonen macht hohe Produktivität möglich, ist aber auch manchmal ein bisschen anstrengend.\nAdvice to Management\nLasst uns in der Gegend auf jeden Fall bleiben. Mit einem ersten Minibüro jetzt in Berlin und vielleicht ja auch in der Zukunft einem kleinen in Leipzig sind wir in der Region doch gut aufgestellt. Bleibt so transparent und lasst uns weiterhin meetups machen. Der Zusammenhalt ist fühlbar.\n"
    }, 
    {
        "pro": "\n- very friendliness atmosphere in day-to-day work (a least i can say for German and NY office) - a lot of smart, motivated and helping people (through the company) - exiting product and market - bi-yearly company meetups help to know whom you working with and helps to set a familiar tone - due the grow of the company it has to change and it does as i feel in a very positive way - if you have a good idea for the produ… \nShow More\n", 
        "con": "\n- if you have a good idea for the product or company structure, just saying is not enough, you have to stand it and bring it up more to the right persons in a proper way (not sure if that is negative or quite normal..)\nAdvice to Management\nContinue to empower people who proved to rock their job, to be engaged, trustful, etc.. So keep spreading the responsibility and treat the humans as the most valuable things in the company!\n"
    }, 
    {
        "pro": "\nVery friendly people and it isn't all about work - you always find someone you share either an interest or a happy with and it easy to make friends. Very honest and focused to the point. Great technology and management structure is flat and direct. Administration is easy and people are helping each other.\n", 
        "con": "\nBuilding up a startup and having such a steep climb is never easy. Scaling up is always an issue especially in a very vibrating part. This can turn out being on a bumpy road ans changing direction - but it is expected being in a startup.\nAdvice to Management\nkeep all doors always open -\n"
    }, 
    {
        "pro": "\nAuf Menschen ausgerichtet - Datameer arbeitet mit einem zusammen, um zu gewährleisten, dass man sich bei seiner Arbeit auch konzentrieren kann. Das kann z. B. bedeuten, dass man früh geht, zu unterschiedlichen Zeiten arbeitet oder im Büro heiratet. Aber uns liegt wirklich viel an unseren Kollegen. Großartige Leute - Bei Datameer habe ich wunderbare Freunde gefunden, woanders hatte ich immer nur ‘Kollegen’. Konstantes… \nShow More\n", 
        "con": "\nGeographische Entfernung - Unser Team erstreckt sich über zwei Kontinente, weshalb manchmal auch die Kommunikation recht schwierig ist. Ein Teil muss deswegen extra früh aufstehen oder der andere muss bis spät abends im Büro bleiben.\n"
    }
]